---
kind: type
id: T:Autodesk.Revit.DB.Events.FileExportingEventArgs
source: html/33fecf48-ec69-4d54-8e73-4f8b6233a744.htm
---
# Autodesk.Revit.DB.Events.FileExportingEventArgs

The event arguments used by the FileExporting event.

## Syntax (C#)
```csharp
public class FileExportingEventArgs : RevitAPIPreDocEventArgs
```